<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"781221ba9f32aca7f31821b990f485a829fded990ceee04d980a361bc15ba60f","plan_job_ref":"Job Test plan target and replace #356 at https://github.com/dflook/terraform-github-actions/actions/runs/6592484850","plan_hash":"fb3b922ef582c41a6ca7ce944a0fef33f4d3183ba8956b609a1613fe2f8a4a17","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "vxiLHxQkHM" -> (known after apply)
  ~ foreach = "BtvNLYJ31R" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #356](https://github.com/dflook/terraform-github-actions/actions/runs/6592484850)